/**
 * \mainpage
 * # Лабораторна робота №15
 *
 * \author Марков Владислав, КН-922б
 * \date 16-04-2023
 */

/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу, код для виводу інофрмацію при помилці, виділу динаиічної пам'яті для вказівників і
виклики функцій 'check_path_to_files', 'check_input_data', 'read_from_file', 'student_sort', 'write_out_file', 'write_on_screen'.
*/

#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Створення змінних
	char path_input_file[PATH_MAX] - масив для запису шляху де знаходиться файл із вхідними даними.
	char path_output_file[PATH_MAX] - масив для запису шляху де треба створити файл із вихідними даними.
	unsigned int result_check[2] - маисв для запису результату преевірки, перше значення номер перевірки, строка у якій помилка.
	unsigned int *res_check - вказівник на масив вище.
	int n_sort_students - кількість відсортованих студентів.
	struct student *sort_student - вакзівник на структуру у якому потім будемо зберінати відсортовані об'єкти структиру student.
	struct student *student - вакзівник на структуру у якому потім будемо зберінати об'єкти структиру student.
	
- Виводимо на екран інформацію про автора, номер, тему лабараторної роботи , і що виконує програма
- Викликаємо функцію `check_path_to_files(argc, argv)`, і в залежності від поверненого значення визначаємо наступні дії
	1 - вивидимо повідомлення `Ви не ввели ніякі дані`  та заврешуємо програму.
	2 - вивидимо повідомлення `Ви ввели некоректну кількість даних`  та заврешуємо програму.
	3 - вивидимо повідомлення `Не можливо отримати доступ до файлу або дерикторії`  та заврешуємо програму.
	0 - перевірка була пройдена.
- Як що перевірка була пройдена записуємо наші аргументи у створені для них маисиви.
- Викликаємо функцію `check_path_to_files(argc, argv)`, і в залежності від поверненого значення визначаємо наступні дії
	1 - вивидимо повідомлення `Ви не ввели кількість студентів`  та заврешуємо програму.
	2 - вивидимо повідомлення `Кількість студентів для сортування дорівню 0`  та заврешуємо програму.
	3 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі форма навчання`  та заврешуємо програму.
	4 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі ім'я студента`  та заврешуємо програму.
	5 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі ім'я куратора`  та заврешуємо програму.
	6 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі назва факультету`  та заврешуємо програму.
	7 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі код групи`  та заврешуємо програму.
	8 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі назва кафедри`  та заврешуємо програму.
	0 - перевірка була пройдена.
- Як що перевірка була пройдена виділяємо пам'ять для вказівників під кількість студентів.
- Викликаємо функцію `read_from_file`, вона запишить дані про кожного студента та рандомно сформує рік вступу.
- Викликаємо функцію `student_sort`, вона запишить відсортує студентів за роком вступу, у нашому випадку це 2018.
- Викликаємо функцію `write_out_file`, запишить результат сортування у файл для вихідних даних.
- Викликаємо функцію `write_on_screen`, виведе результат сортування у консолі.
- Звільняємо пам'ять яку ми виділяли для наших вказівників та завершуємо роботу програми.
*/

int main(int argc, char* argv[])
{
	char path_input_file[4096] = {0};
	char path_output_file[4096] = {0};
	unsigned int result_check[2] = {0,0};
	unsigned int *res_check = result_check;
	int n_sort_students;
	struct student *sort_student;
	struct student *student;
	
	printf("\nАвтор:Марков Владислав\nГрупа:КН-922Б\nНомер лабараторної роботи:15\nТема:Структуровані типи даних\n\n");
	printf("Вивести список усіх студентів які поступили у 2018р.\n\n");
		
	switch (check_path_to_files(argc, argv)){
	case 01:
		printf("Ви не ввели ніякі дані\n");
		return 1;
		break;

	case 02:
		printf("Ви ввели некоректну кількість даних\n");
		return 1;
		break;

	case 03:
		printf("Не можливо отримати доступ до файлу або дерикторії\n");
		return 1;
		break;
	}
	
	strcat(path_output_file,*(argv + 2));
	strcat(path_input_file,*(argv + 1));
	
	
	check_input_data(res_check, path_input_file);

	switch (*res_check){
	case 1:
		printf("Ви не ввели кількість студентів\n\n");
		return 1;
		break;

	case 2:
		printf("Кількість студентів для сортування дорівню 0\n\n");
		return 1;
		break;

	case 3:
		printf("У вас помилка на строці:%d, у полі форма навчання\n\n", *(res_check + 1));
		return 1;
		break;
	
	case 4:
		printf("У вас помилка на строці:%d, у полі ім'я студента\n\n", *(res_check + 1));
		return 1;
		break;
	
	case 5:
		printf("У вас помилка на строці:%d, у полі ім'я куратора\n\n", *(res_check + 1));
		return 1;
		break;
		
	case  6:
		printf("У вас помилка на строці:%d, у полі назва факультету\n\n", *(res_check + 1));
		return 1;
		break;
	
	case  7:
		printf("У вас помилка на строці:%d, у полі код групи\n\n", *(res_check + 1));
		return 1;
		break;
		
	case  8:
		printf("У вас помилка на строці:%d, у полі назва кафедри\n\n", *(res_check + 1));
		return 1;
		break;
	}
	
	student = malloc(sizeof(struct student) * *(res_check + 1));
	sort_student = malloc(sizeof(struct student) * *(res_check + 1));
	
	read_from_file(path_input_file, student);
	
	n_sort_students = student_sort(student, sort_student, res_check);
	
	write_out_file(path_output_file, sort_student, n_sort_students);
	
	write_on_screen(sort_student, n_sort_students);
	
	free(student);
	free(sort_student);
	
	return 0;
}

















