/**
 * \mainpage
 * # Лабораторна робота №15
 *
 * \author Марков Владислав, КН-922б
 * \date 16-04-2023
 */

/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу, код для виводу інофрмацію при помилці, виділу динаиічної пам'яті для вказівників і
виклики функцій 'check_path_to_files', 'check_input_data', 'read_from_file', 'student_sort', 'write_out_file', 'write_on_screen'.
*/

#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Створення змінних
	char path_input_file[PATH_MAX] - масив для запису шляху де знаходиться файл із вхідними даними.
	char path_output_file[PATH_MAX] - масив для запису шляху де треба створити файл із вихідними даними.
	unsigned int result_check[2] - маисв для запису результату преевірки, перше значення номер перевірки, строка у якій помилка.
	unsigned int *res_check - вказівник на масив вище.
	int n_sort_students - кількість відсортованих студентів.
	struct student *sort_student - вакзівник на структуру у якому потім будемо зберінати відсортовані об'єкти структиру student.
	struct student *student - вакзівник на структуру у якому потім будемо зберінати об'єкти структиру student.
	
- Виводимо на екран інформацію про автора, номер, тему лабараторної роботи , і що виконує програма
- Викликаємо функцію `check_path_to_files(argc, argv)`, і в залежності від поверненого значення визначаємо наступні дії
	1 - вивидимо повідомлення `Ви не ввели ніякі дані`  та заврешуємо програму.
	2 - вивидимо повідомлення `Ви ввели некоректну кількість даних`  та заврешуємо програму.
	3 - вивидимо повідомлення `Не можливо отримати доступ до файлу або дерикторії`  та заврешуємо програму.
	0 - перевірка була пройдена.
- Як що перевірка була пройдена записуємо наші аргументи у створені для них маисиви.
- Викликаємо функцію `check_path_to_files(argc, argv)`, і в залежності від поверненого значення визначаємо наступні дії
	1 - вивидимо повідомлення `Ви не ввели кількість студентів`  та заврешуємо програму.
	2 - вивидимо повідомлення `Кількість студентів для сортування дорівню 0`  та заврешуємо програму.
	3 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі форма навчання`  та заврешуємо програму.
	4 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі ім'я студента`  та заврешуємо програму.
	5 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі ім'я куратора`  та заврешуємо програму.
	6 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі назва факультету`  та заврешуємо програму.
	7 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі код групи`  та заврешуємо програму.
	8 - вивидимо повідомлення `У вас помилка на строці:(№ строки), у полі назва кафедри`  та заврешуємо програму.
	0 - перевірка була пройдена.
- Як що перевірка була пройдена виділяємо пам'ять для вказівників під кількість студентів.
- Викликаємо функцію `read_from_file`, вона запишить дані про кожного студента та рандомно сформує рік вступу.
- Викликаємо функцію `student_sort`, вона запишить відсортує студентів за роком вступу, у нашому випадку це 2018.
- Викликаємо функцію `write_out_file`, запишить результат сортування у файл для вихідних даних.
- Викликаємо функцію `write_on_screen`, виведе результат сортування у консолі.
- Звільняємо пам'ять яку ми виділяли для наших вказівників та завершуємо роботу програми.
*/

int main(int argc, char* argv[])
{
	unsigned int result_check[2] = {0,0};
	unsigned int *res_check = result_check;
	struct student_arr *arr_sort_students;
	struct student_arr *arr_students;
	
	printf("\nАвтор:Марков Владислав\nГрупа:КН-922Б\nНомер лабараторної роботи:15\nТема:Структуровані типи даних\n\n");
	printf("Вивести список усіх студентів які поступили у 2018р.\n\n");
		
	if((*res_check = check_arguments(argc, argv)) != 0){
	
		write_info_error(res_check);
		return 1;
	
	}
	
	check_input_data(res_check, *(argv + 1));
	if(*res_check != 0){
	
		write_info_error(res_check);
		return 1;
	
	}
	
	
	arr_students = create_arr_students(*(res_check + 1));
	
	read_from_file(*(argv + 1), arr_students);
	
	arr_sort_students = student_sort(arr_students);
	
	write_out_file(*(argv + 2), arr_sort_students);
	
	write_on_screen(arr_sort_students);
	
	free(arr_students->students);
	free(arr_students);
	free(arr_sort_students->students);
	free(arr_sort_students);
	
	return 0;
}

















